
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 11 to destroy.</code></pre>

* Update
  * module.api_mgmt_product.azurerm_api_management_product.product
* Delete
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;create-schedule&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;direct-listing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;get-sessions&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;update-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;create-schedule&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;direct-listing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;get-sessions&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;create-schedule&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;direct-listing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;get-sessions&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;update-hearing&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["create-schedule"] will be destroyed
  # (because key ["create-schedule"] is not in for_each map)
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Create Schedule" -> null
      - display_name        = "Create Schedule" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/create-schedule" -> null
      - method              = "POST" -> null
      - operation_id        = "create-schedule" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/schedules" -> null

      - request {
          - header {
              - default_value = "CFT" -> null
              - name          = "Source-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "MOCK" -> null
              - name          = "Destination-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "2019-10-12T07:20:00Z" -> null
              - name          = "Request-Created-At" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "application/json" -> null
              - name          = "Content-Type" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
        }

      - response {
          - status_code = 201 -> null
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["direct-listing"] will be destroyed
  # (because key ["direct-listing"] is not in for_each map)
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Direct Listing" -> null
      - display_name        = "Direct Listing" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/direct-listing" -> null
      - method              = "POST" -> null
      - operation_id        = "direct-listing" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/" -> null

      - request {
        }

      - response {
          - status_code = 200 -> null
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["get-sessions"] will be destroyed
  # (because key ["get-sessions"] is not in for_each map)
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Get Sessions" -> null
      - display_name        = "Get Sessions" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-sessions" -> null
      - method              = "GET" -> null
      - operation_id        = "get-sessions" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/sessions" -> null

      - request {
          - header {
              - default_value = "CFT" -> null
              - name          = "Source-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "MOCK" -> null
              - name          = "Destination-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "2019-10-12T07:20:00Z" -> null
              - name          = "Request-Created-At" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "application/json" -> null
              - name          = "Content-Type" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }

          - query_parameter {
              - name     = "requestStartDate" -> null
              - required = false -> null
              - type     = "string" -> null
              - values   = [] -> null
            }
          - query_parameter {
              - name     = "requestEndDate" -> null
              - required = false -> null
              - type     = "string" -> null
              - values   = [] -> null
            }
          - query_parameter {
              - name     = "requestJudgeType" -> null
              - required = false -> null
              - type     = "string" -> null
              - values   = [] -> null
            }
          - query_parameter {
              - name     = "requestLocationId" -> null
              - required = false -> null
              - type     = "string" -> null
              - values   = [] -> null
            }
          - query_parameter {
              - name     = "requestDuration" -> null
              - required = false -> null
              - type     = "string" -> null
              - values   = [] -> null
            }
          - query_parameter {
              - name     = "requestSessionType" -> null
              - required = false -> null
              - type     = "string" -> null
              - values   = [] -> null
            }
        }

      - response {
          - status_code = 200 -> null
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-hearing"] will be destroyed
  # (because key ["update-hearing"] is not in for_each map)
  - resource "azurerm_api_management_api_operation" "apim_api_operation" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - description         = "Update Hearing" -> null
      - display_name        = "Update Hearing" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-hearing" -> null
      - method              = "PUT" -> null
      - operation_id        = "update-hearing" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - url_template        = "/hearings/{hearing-id}" -> null

      - request {
          - header {
              - default_value = "CFT" -> null
              - name          = "Source-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "MOCK" -> null
              - name          = "Destination-System" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "2019-10-12T07:20:00Z" -> null
              - name          = "Request-Created-At" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
          - header {
              - default_value = "application/json" -> null
              - name          = "Content-Type" -> null
              - required      = true -> null
              - type          = "string" -> null
              - values        = [] -> null
            }
        }

      - response {
          - status_code = 202 -> null
        }

      - template_parameter {
          - name     = "hearing-id" -> null
          - required = true -> null
          - type     = "string" -> null
          - values   = [] -> null
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["create-schedule"] will be destroyed
  # (because key ["create-schedule"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/create-schedule/policies/xml" -> null
      - operation_id        = "create-schedule" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - xml_content         = (sensitive value) -> null
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["direct-listing"] will be destroyed
  # (because key ["direct-listing"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/direct-listing/policies/xml" -> null
      - operation_id        = "direct-listing" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - xml_content         = (sensitive value) -> null
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["get-sessions"] will be destroyed
  # (because key ["get-sessions"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      - api_management_name = "sds-api-mgmt-stg" -> null
      - api_name            = "hmi-apim" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-sessions/policies/xml" -> null
      - operation_id        = "get-sessions" -> null
      - resource_group_name = "ss-stg-network-rg" -> null
      - xml_content         = (sensitive value) -> null
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["create-schedule"] will be destroyed
  # (because key ["create-schedule"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      - api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/create-schedule" -> null
      - display_name     = "schedules" -> null
      - id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/create-schedule/tags/schedules" -> null
      - name             = "schedules" -> null
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["direct-listing"] will be destroyed
  # (because key ["direct-listing"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      - api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/direct-listing" -> null
      - display_name     = "direct-listing" -> null
      - id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/direct-listing/tags/direct-listing" -> null
      - name             = "direct-listing" -> null
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["get-sessions"] will be destroyed
  # (because key ["get-sessions"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      - api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-sessions" -> null
      - display_name     = "sessions" -> null
      - id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-sessions/tags/sessions" -> null
      - name             = "sessions" -> null
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["update-hearing"] will be destroyed
  # (because key ["update-hearing"] is not in for_each map)
  - resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      - api_operation_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-hearing" -> null
      - display_name     = "hearings" -> null
      - id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-hearing/tags/hearings" -> null
      - name             = "hearings" -> null
    }

Plan: 0 to add, 1 to change, 11 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["create-schedule"] has changed
  ~ resource "azurerm_api_management_api_operation" "apim_api_operation" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/create-schedule"
        # (8 unchanged attributes hidden)

      ~ request {
          ~ header {
                name          = "Source-System"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Destination-System"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Request-Created-At"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Content-Type"
              + values        = []
                # (3 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["get-sessions"] has changed
  ~ resource "azurerm_api_management_api_operation" "apim_api_operation" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/get-sessions"
        # (8 unchanged attributes hidden)

      ~ request {
          ~ header {
                name          = "Source-System"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Destination-System"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Request-Created-At"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Content-Type"
              + values        = []
                # (3 unchanged attributes hidden)
            }

          ~ query_parameter {
                name     = "requestStartDate"
              + values   = []
                # (2 unchanged attributes hidden)
            }
          ~ query_parameter {
                name     = "requestEndDate"
              + values   = []
                # (2 unchanged attributes hidden)
            }
          ~ query_parameter {
                name     = "requestJudgeType"
              + values   = []
                # (2 unchanged attributes hidden)
            }
          ~ query_parameter {
                name     = "requestLocationId"
              + values   = []
                # (2 unchanged attributes hidden)
            }
          ~ query_parameter {
                name     = "requestDuration"
              + values   = []
                # (2 unchanged attributes hidden)
            }
          ~ query_parameter {
                name     = "requestSessionType"
              + values   = []
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-hearing"] has changed
  ~ resource "azurerm_api_management_api_operation" "apim_api_operation" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/hmi-apim/operations/update-hearing"
        # (8 unchanged attributes hidden)

      ~ request {
          ~ header {
                name          = "Source-System"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Destination-System"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Request-Created-At"
              + values        = []
                # (3 unchanged attributes hidden)
            }
          ~ header {
                name          = "Content-Type"
              + values        = []
                # (3 unchanged attributes hidden)
            }
        }

      ~ template_parameter {
            name     = "hearing-id"
          + values   = []
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":43,"Program":"tfcmt","SHA1":"","Vars":{}} -->